# 3.7 Combining datasets: merge and join

In [1]:
import numpy as np
import pandas as pd

# Categories of joins

The ```pd.merge()``` function implements a number of types of joins: the one-to-one, many-to-one, and many-to-many joins.

## One-to-one joins

In [12]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})

In [13]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [14]:
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [15]:
df3=pd.merge(df1, df2)

In [16]:
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

## Many-to-one joins

In [17]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})

In [18]:
df4

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [19]:
pd.merge(df3, df4)

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

## Many-to-many joins

In [21]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
                              'Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux',
                               'spreadsheets', 'organization']})

In [22]:
df5

         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

In [26]:
pd.merge(df1, df5)

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

# Specification of the merge key

## The ```on``` keyword

In [27]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [28]:
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [29]:
pd.merge(df1, df2, on="employee")

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

## The ```left_on``` and ```right_on``` keywords

In [44]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})

In [45]:
df3

   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [46]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [47]:
pd.merge(df1, df3, left_on="employee", right_on="name")

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [48]:
pd.merge(df1, df3, left_on="employee", right_on="name").drop("name", axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

## The ```left_index``` and ```right_index``` keywords

In [49]:
df1a=df1.set_index("employee")

In [50]:
df1a

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

In [54]:
df2a=df2.set_index("employee")

In [55]:
df2a

          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [56]:
pd.merge(df1a, df2a, left_index=True, right_index=True)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [57]:
df1a

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

In [58]:
df3

   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [59]:
pd.merge(df1a, df3, left_index=True, right_on="name")

         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
2  Engineering  Lisa  120000
3           HR   Sue   90000

In [60]:
df2a

          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

# Specifying set arithmetic for joins

In [62]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                    'food': ['fish', 'beans', 'bread']},
                   columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                   columns=['name', 'drink'])

In [63]:
df6

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

In [64]:
df7

     name drink
0    Mary  wine
1  Joseph  beer

In [65]:
pd.merge(df6, df7)

   name   food drink
0  Mary  bread  wine

In [66]:
pd.merge(df6, df7, how="inner")

   name   food drink
0  Mary  bread  wine

In [68]:
pd.merge(df6, df7, how="outer")

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [69]:
pd.merge(df6, df7, how="left")

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [70]:
pd.merge(df6, df7, how="right")

     name   food drink
0    Mary  bread  wine
1  Joseph    NaN  beer

# Overlapping column names: The ```suffixes``` keyword

In [71]:
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [1, 2, 3, 4]})
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [3, 1, 4, 2]})

In [72]:
df8

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

In [73]:
df9

   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

In [78]:
pd.merge(df8, df9, on="name", suffixes=["_L", "_R"])

   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

# 3.8 Aggregation and grouping

# Simple aggregation in Pandas

In [88]:
rng=np.random.RandomState(42)

In [89]:
ser=pd.Series(rng.rand(5))

In [90]:
ser

0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
dtype: float64

In [91]:
ser.sum()

2.811925491708157

In [92]:
sum(ser)

2.811925491708157

In [93]:
ser.mean()

0.5623850983416314

In [95]:
df=pd.DataFrame({"A": rng.rand(5), "B": rng.rand(5)})

In [96]:
df

          A         B
0  0.155995  0.020584
1  0.058084  0.969910
2  0.866176  0.832443
3  0.601115  0.212339
4  0.708073  0.181825

In [99]:
df.mean()

A    0.477888
B    0.443420
dtype: float64

In [101]:
df.mean(axis=1)

0    0.088290
1    0.513997
2    0.849309
3    0.406727
4    0.444949
dtype: float64

# GroupBy: split, apply, combine

In [102]:
df=pd.DataFrame({"key": ["A", "B", "C", "A", "B", "C"], "data": range(6)})

In [103]:
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [108]:
df.groupby("key").sum()

     data
key
A       3
B       5
C       7

## Aggregate, filter, transform, apply

In [109]:
rng=np.random.RandomState(0)

In [110]:
df=pd.DataFrame({"key": ["A", "B", "C", "A", "B", "C"], "data1": range(6), "data2": rng.randint(0, 10, 6)})

In [111]:
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

### Aggregation

In [117]:
df.groupby("key").aggregate([np.min, "median", np.max])

    data1             data2
     amin median amax  amin median amax
key
A       0    1.5    3     3    4.0    5
B       1    2.5    4     0    3.5    7
C       2    3.5    5     3    6.0    9

In [118]:
df.groupby("key").aggregate({"data1": np.min, "data2": np.max})

     data1  data2
key
A        0      5
B        1      7
C        2      9

## Filtering

In [119]:
def filter_func(x):
    return x["data2"].std()>4

In [124]:
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [120]:
filter_func(df)

False

In [125]:
df.groupby("key").filter(filter_func)

  key  data1  data2
1   B      1      0
2   C      2      3
4   B      4      7
5   C      5      9

In [126]:
df.groupby("key").std()

       data1     data2
key
A    2.12132  1.414214
B    2.12132  4.949747
C    2.12132  4.242641

## Transformation

In [127]:
df.groupby("key").transform(lambda x:x-x.mean())

   data1  data2
0   -1.5    1.0
1   -1.5   -3.5
2   -1.5   -3.0
3    1.5   -1.0
4    1.5    3.5
5    1.5    3.0

## The ```apply()``` method

In [154]:
def norm_by_data2(x):
    x["data1"]=x["data1"]/x["data2"].sum()
    return x

In [155]:
df=pd.DataFrame({"key": ["A", "B", "C", "A", "B", "C"], "data1": range(6), "data2": rng.randint(0, 10, 6)})

In [156]:
df.groupby("key").apply(norm_by_data2)

  key     data1  data2
0   A  0.000000      3
1   B  0.062500      7
2   C  0.222222      0
3   A  0.750000      1
4   B  0.250000      9
5   C  0.555556      9

## Specifying the split key

In [135]:
L=[0, 1, 0, 1,2, 0]

In [157]:
df

  key  data1  data2
0   A      0      3
1   B      1      7
2   C      2      0
3   A      3      1
4   B      4      9
5   C      5      9

In [158]:
df.groupby(L).sum()

   data1  data2
0      7     12
1      4      8
2      4      9

## A dictionary series mapping index to group

In [188]:
df2=df.set_index("key")

In [189]:
df2

     data1  data2
key
A        0      3
B        1      7
C        2      0
A        3      1
B        4      9
C        5      9

In [161]:
mapping={"A": "vowel", "B": "consonant", "C": "consonant"}

In [162]:
mapping

{'A': 'vowel', 'B': 'consonant', 'C': 'consonant'}

In [163]:
df2.groupby(mapping).sum()

           data1  data2
consonant     12     25
vowel          3      4

## Any Python function

In [193]:
df2

     data1  data2
key
A        0      3
B        1      7
C        2      0
A        3      1
B        4      9
C        5      9

In [196]:
df2.groupby("key").mean()

     data1  data2
key
A      1.5    2.0
B      2.5    8.0
C      3.5    4.5

In [201]:
df=pd.DataFrame({"key": ["A", "B", "C", "A", "B", "C"], "data1": range(6), "data2": rng.randint(0, 10, 6)})

In [202]:
df

  key  data1  data2
0   A      0      2
1   B      1      0
2   C      2      0
3   A      3      4
4   B      4      5
5   C      5      5

In [203]:
dff=df.set_index("key")

In [204]:
dff

     data1  data2
key
A        0      2
B        1      0
C        2      0
A        3      4
B        4      5
C        5      5

In [209]:
dff.groupby(str.lower).mean()

TypeError: lower() takes no arguments (1 given)